# В некоторой школе решили набрать три новых 
# математических класса и оборудовать кабинеты 
# для них новыми партами. За каждой партой может 
# сидеть два учащихся. Известно количество учащихся 
# в каждом из трех классов. Выведите наименьшее число
# парт, которое нужно приобрести для них.
# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32

# from math import ceil

# print("Введите количество учеников в первом классе: ")
# a = int(input())
# print("Введите количество учеников во втором классе: ")
# b = int(input())
# print("Введите количество учеников в третьем классе: ")
# с = int(input())

# a1 = ceil(a / 2)
# b1 = ceil(b / 2)
# c1 = ceil(с / 2)

# print("Потребуется", (a1 + b1 + c1), "парт" )

# print("Введите количество учеников в первом классе: ")
# a = int(input())
# print("Введите количество учеников во втором классе: ")
# b = int(input())
# print("Введите количество учеников в третьем классе: ")
# c = int(input())

# print((a // 2) + (a % 2) + (b // 2) + (b % 2) + (c // 2) + (c % 2)
# print((a + 1)// 2 + (b + 1)// 2 + (c + 1)// 2)

